books = [{"title":"1984","author":"Джордж Оруэлл","year":"1949"},
         {"title":"Война и мир","author":"Лев Толстой","year":"1869"},
         {"title":"Метро 2033","author":"Дмитрий Глуховский","year":"2005"},
         {"title":"Дом в котором","author":"Мариам Петросян","year":"2009"},
         {"title":"Пикник на обочине","author":"братья Стругацкие","year":"1972"}]
for i in range(len(books)):
    print(f"------------------ Книга {i+1} ------------------")
    print(f"Название: {books[i]["title"]}, Автор: {books[i]["author"]}")
    print(f"------------------- {books[i]["year"]} -------------------")
    print()