books = [{"id": 1,"title":"1984","author":"Джордж Оруэлл","year":"1949"},
         {"id": 2,"title":"Война и мир","author":"Лев Толстой","year":"1869"},
         {"id": 3,"title":"Метро 2033","author":"Дмитрий Глуховский","year":"2005"},
         {"id": 4,"title":"Дом в котором","author":"Мариам Петросян","year":"2009"},
         {"id": 5,"title":"Пикник на обочине","author":"братья Стругацкие","year":"1972"}]
for book in books:
    print(f"------------------ Книга {book["id"]} ------------------")
    print(f"Название: {book["title"]}, Автор: {book["author"]}")
    print(f"------------------- {book["year"]} -------------------")
    print()
